### Pandas: operaciones con DataFrames

In [1]:
import pandas as pd

In [2]:
carpeta = "../ficheros_curso/names/"

In [3]:
def cargaDF(path):
    df = pd.read_csv(path, header=None, names=['nombre','sexo','total'])
    df.set_index(["nombre","sexo"], inplace=True)
    return df

In [15]:
def sumarDF(path1, path2):
    df1 = cargaDF(path1)
    df2 = cargaDF(path2)
    
    suma = df2000.add(df2001, fill_value=0)
    suma.sort_values("total", ascending=False, inplace=True)
    return suma

In [4]:
df2000 = cargaDF(carpeta+"yob2000.txt")
df2000.head()

              total
nombre  sexo
Emily   F     25953
Hannah  F     23078
Madison F     19967
Ashley  F     17996
Sarah   F     17691

In [5]:
df2001 = cargaDF(carpeta+"yob2001.txt")
df2001.head()

              total
nombre  sexo
Emily   F     25054
Madison F     22162
Hannah  F     20709
Ashley  F     16526
Alexis  F     16399

In [6]:
suma = df2000 + df2001
suma.head(10)

                total
nombre    sexo
Aadam     M       NaN
Aadarsh   M      12.0
Aaden     M       NaN
Aadil     M      16.0
Aaditya   M      25.0
Aahil     M      11.0
Aailyah   F      18.0
Aaisha    F      13.0
Aajaylah  F       NaN
Aakanksha F       NaN

In [12]:
df2001.loc["Madison","F"]

total    22162
Name: (Madison, F), dtype: int64

In [16]:
suma2 = sumarDF(carpeta+"yob2000.txt", carpeta+"yob2001.txt")

In [17]:
suma2.head()

                total
nombre  sexo
Jacob   M     67006.0
Michael M     61712.0
Matthew M     55376.0
Joshua  M     53547.0
Emily   F     51007.0

In [18]:
suma2.reset_index(inplace=True)
suma2.head(10)

        nombre sexo    total
0        Jacob    M  67006.0
1      Michael    M  61712.0
2      Matthew    M  55376.0
3       Joshua    M  53547.0
4        Emily    F  51007.0
5  Christopher    M  48048.0
6     Nicholas    M  47490.0
7       Andrew    M  46040.0
8       Joseph    M  44822.0
9       Hannah    F  43787.0